Revit 2026 API

# FabricationPartGetDimensions Method

---

Gets all fabrication dimensions.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<FabricationDimensionDefinition> GetDimensions()
```
```vb
Public Function GetDimensions As IList(Of FabricationDimensionDefinition)
```
```cpp
public:
IList<FabricationDimensionDefinition^>^ GetDimensions()
```
```fsharp
member GetDimensions : unit -> IList<FabricationDimensionDefinition>
```

#### Return Value

IListFabricationDimensionDefinition Returns an array of fabrication dimensions.

#### Reference

FabricationPart Class

Autodesk.Revit.DB Namespace